run/tutorials/flowTests/navyCylinderSheddingTest/bodyFittedCylinderCircular/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 10;

vertices
(
    // Cylinder, back
    ( 0    -0.05 0)
    ( 0.05  0    0)
    ( 0     0.05 0)
    (-0.05  0    0)

    ( 0   -0.8   0)
    ( 0.8  0     0)
    ( 0    0.8   0)
    (-0.8  0     0)

    ( 0    -2    0)
    (  2    0    0)
    ( 0     2    0)
    ( -2    0    0)

    // Cylinder, front
    ( 0    -0.05 0.05)
    ( 0.05  0    0.05)
    ( 0     0.05 0.05)
    (-0.05  0    0.05)

    ( 0   -0.8   0.05)
    ( 0.8  0     0.05)
    ( 0    0.8   0.05)
    (-0.8  0     0.05)

    ( 0    -2    0.05)
    (  2    0    0.05)
    ( 0     2    0.05)
    ( -2    0    0.05)
);

blocks
(
    // Inner, with grading
    hex (0 4 5 1 12 16 17 13)   (78 30 1) simpleGrading (34.8 1 1)
    hex (1 5 6 2 13 17 18 14)  (78 30 1) simpleGrading (34.8 1 1)
    hex (2 6 7 3 14 18 19 15) (78 30 1) simpleGrading (34.8 1 1)
    hex (3 7 4 0 15 19 16 12)  (78 30 1) simpleGrading (34.8 1 1)

    // Outer, uniform
    hex (0 4 5 1 12 16 17 13)   (78 30 1) simpleGrading (34.8 1 1)
    hex (1 5 6 2 13 17 18 14)  (78 30 1) simpleGrading (34.8 1 1)
    hex (2 6 7 3 14 18 19 15) (78 30 1) simpleGrading (34.8 1 1)
    hex (3 7 4 0 15 19 16 12)  (78 30 1) simpleGrading (34.8 1 1)

);

edges
(
    // Inner arc, back
    arc  0  1 ( 0.035355 -0.035355 0)
    arc  1  2 ( 0.035355  0.035355 0)
    arc  2  3 (-0.035355  0.035355 0)
    arc  3  0 (-0.035355 -0.035355 0)

    // Inner arc, front
    arc 12 13 ( 0.035355 -0.035355 0.05)
    arc 13 14 ( 0.035355  0.035355 0.05)
    arc 14 15 (-0.035355  0.035355 0.05)
    arc 15 12 (-0.035355 -0.035355 0.05)

    // Middle arc, back
    arc  4  5 ( 0.565685 -0.565685 0)
    arc  5  6 ( 0.565685  0.565685 0)
    arc  6  7 (-0.565685  0.565685 0)
    arc  7  4 (-0.565685 -0.565685 0)

    // Middle arc, front
    arc  16 17 ( 0.565685 -0.565685 0.05)
    arc  17 18 ( 0.565685  0.565685 0.05)
    arc  18 19 (-0.565685  0.565685 0.05)
    arc  19 16 (-0.565685 -0.565685 0.05)

    // Outer arc, back
    arc  8  9 ( 1.4142125 -1.4.142125 0)
    arc  9 10 ( 1.4142125  1.4.142125 0)
    arc 10 11 (-1.4142125  1.4.142125 0)
    arc 11  8 (-1.4142125 -1.4.142125 0)

    // Outer arc, front
    arc  20 21 ( 1.4142125 -1.4142125 0.05)
    arc  21 22 ( 1.4142125  1.4142125 0.05)
    arc  22 23 (-1.4142125  1.4142125 0.05)
    arc  23 20 (-1.4142125 -1.4142125 0.05)
);

patches
(
    wall cylinder
    (
        ( 0 12 13  1)
        ( 1 13 14  2)
        ( 2 14 15  3)
        ( 3 15 12  0)
    )

//     patch outerCylinder
//     (
//         ( 4  5 13 12)
//         ( 5  6 14 13)
//         ( 6  7 15 14)
//         ( 7  4 12 15)
//     )

//     empty frontAndBack
//     (
//         (8 9 13 12)
//         (9 10 14 13)
//         (10 11 15 14)
//         (11 8 12 15)

//         (16 20 21 17)
//         (17 21 22 18)
//         (18 22 23 19)
//         (19 23 20 16)
//     )
);


mergePatchPairs
(
);

// ************************************************************************* //
